[{"id":160788420,"title":"Self study VS studying at a reputed institute - Which is more effective to get into the NEET?\r","date":"December 14, 2020\r","Class":["Maths\r"],"content":"\r\nIf you are dedicated and confident enough for self study ..then a big YES!!\r\n\r\n**If you move forward by self-studying**\r\n\r\n**Biology** is 80% from NCERT only…You can attempt 75–80 question just by doing NCERT properly.\r\n\r\n**Physics**….for physics i will suggest to to take a person tutor…because there are few things which you really can’t study without proper support of a experienced tutor. Read Pradeep thoroughly as it is the best book i ever seen for theory….NCERT theory is really very good… For question solving have DC pandey\r\n\r\n**Chemistry -** For inorganic chemistry just follow NCERT only…i am 100% sure that you will not loose even a single mark. For physical again i will suggest you to take a tutor or you can purchase plancess video lectures for chemistry. For organic do NCERT and some reference book(Best is mtg)\r\n\r\nWith proper study, one can score 540+ by self studying.\r\n\r\n**BUT**\r\n\r\nNow imagine yourself sitting in a room, studying alone. Though you are concentrating but you don’t know the amount of competition you’ll have to face in the real EXAM.During the whole year you won’t be able to FACE the competition which exists around you. Above all , home is a place of distractions. You know siblings , neighbors , noises etc. **Concentration needs PEACE.**\r\n\r\nYou’ll have mock tests , surprise tests etc in **coaching** **institute**. Tutors will tell you a number of tips and tricks when you are a student of a coaching . **The tutors have knowledge about each and every chapter**. You’ll see that many students are ahead of you in scoring marks in tests. They’ll tell you what is important and what is not that important. **There are score cards , rank cards , everything. Their experience will add up to your marks.**\r\n\r\n**WHAT TO DO!!**\r\n\r\n- **If you are too sure, confident and dedicated - only then move forward with self study.**\r\n- **If you wish to aim high, go for coaching.**\r\n- **If you live far away from a coaching institute, buy DLP**\r\n\r\n**For Best Possible Results !!**\r\n\r\n**Enroll with a Reputed Institute with excellent teachers, and then you have to make your best of Self Study at home coupled with lots of daily practice of homework problems.**\r\n\r\n**Students who are very highly self motivated and self disciplined, coupled with parental guidance, support and monitoring are able to clear NEET with self studies alone, but in my opinion it takes a right mix of coaching and a lot of study at home that make the path a lot easier for a lot of students**\r\n"},{"id":160753860,"title":"PHYSICS KE NUMERICALS NAHI HOTE KYA KARU!!! HERE'S THE SOLUTION\r","date":"December 10, 2020\r","Class":["\"IMPROVE MARKS\", \"NEET\", \"PHYSICS FEAR\", \"PHYSICS\"\r"],"content":"\r\nThe problem with subjects PCB is, if you are scared from anyone of those, that subject won't leave an inch to haunt and remind you periodically about your weakness. And for majority of the NEET aspirants, Physics is that subject.\r\n\r\nRunning away isn't a solution. We need to tackle it.\r\n\r\n**Following are key points which will help you to rectify your problems in physics and solve the numericals efficiently**\r\n\r\n- Try and understand what the concept is all about. You should know **HOW AND WHY** that particular concept is true.\r\n- Whenever you read a question, write what data is given what you have to find out **WITH UNITS**.\r\n- Before solving numericals of a new concept, try to look and **understand at least 5-10 numericals** of that concept. This will help you getting an idea to approach questions.\r\n- Have proper concentration while solving to avoid calculation error.\r\n- Draw diagrams for the questions where required because for a physics student **DIAGRAM IS HIS/HER LANGUAGE OF COMMUNICATION**.\r\n- **Always start with the easiest questions**. No need to start with hard ones. As you gain confidence by solving the easy ones, **gradually increase the toughness level.**\r\n- Solve 50-100 questions of each chapter to gain confidence.\r\n- **Your no. of Qs to solve should be directly proportional to importance of that topic.**\r\n- Don't get frustrated. **Have patience** and never be tired of learning.\r\n- Believe in yourself.\r\n\r\n**_Pro Tip_** - The more you try to solve a numerical in correct different ways or you try to solve a numerical after getting stuck in it, the better you are leaning. So, don't lose hope and always try. Half of the problem is solved here.\r\n\r\nAll the best Aspirants\r\n\r\n😄😄😄\r\n"},{"id":160736580,"title":"10 QUALITIES AND SKILLS AN ASPIRANT SHOULD HAVE!\r","date":"December 08, 2020\r","Class":["\"IMPROVE MARKS\", \"NEET\"\r"],"content":"\r\nApart from study, there are things on which proper attention will yield good marks. These small things also matter when we have to score at a bigger stage. These qualities actually are the difference between an ordinary and an extraordinary performer.\r\n\r\nFollowing are top 10 qualities which I think NEET aspirants must entrench in their genes.\r\n\r\n- _Focus_- Be like Arjuna, and focus only on the fish’s eye(here NEET)\r\n- _Humbleness_- Don’t blow your own trumpet. Remain down to earth. Accept challenges with a firm conviction, victory with a smile and failure with realisation.\r\n- *Smart-learner* - There are a lot of books available in the market for NEET preparation. A NEET aspirant must be smart enough to choose the right books and to choose the right content from those books. Start Practicing previous year questions and you will yourself understand which topics to prepare and which to discard.\r\n- **_Balanced learner_-** A NEET aspirant must never study a single subject too much in depth ignoring other subjects. Although biology questions are asked more in exam but this factor is balanced by the fact that they are easier than physics and chemistry questions.\r\n- **_One who pushes limits_-**  A NEET aspirant must have the potential to push his/her limit gradually day by day, i.e. one must gradually increase the amount of studies and hard-work as the days progress.\r\n- **_Consistency_-** Proceed towards your goal with average speed. Be like the turtle and not the rabbit.\r\n- *Covertness* - Study a lot. A lot! But never show it to others. It’s an undercover operation of 1/2 years.\r\n- ***Management of stress* -**  Try meditation, go for a walk, visit local attraction.\r\n- **_Have a hobby_** - you can't just study all day, your mind needs rest too. So just have a hobby it can be anything and invest your time in that too so that you can freshen up your mind.\r\n- *Ability to ignore negative and toxic people* - if you want to get successful, then first surround yourself with positive and appreciating people. It's really important and they play a great role constant support of positivity .\r\n"},{"id":160727940,"title":"INTRODUCTION TO NEET\r","date":"December 07, 2020\r","Class":["\"NEET\"\r"],"content":"\r\nDoctor is considered as one of the most prestigious profession. Seeing its pride and respect all over, many students dream and parents wish to raise them to be a doctor.\r\n\r\n\\\r\n**NEET - National Entrance cum Eligibility Test is an examination conducted in first Sunday of May**. Unlike JEE Mains, this is an annual exam.\r\n\r\nNEET paper is of total 720 marks containing 45 questions of physics, 45 questions of chemistry and 90 questions of biology.Each question carry weightage of 4 marks and 1 mark is deducted as negative marking (if ques is attempted wrong).After results are out, cut off is released.The more is the number , the better government college you get for enrollment after COUNSELLING .Clear NEET and getting one of the best medical college is dreams of many students.Proper strategy and work hard can make this dream come true.\r\n\r\n**WHO ALL APPEAR FOR THIS EXAMINATION?**\r\n\r\nCBSE Class 12, ISC Class 12 and other science class 12 students, along with droppers appear for NEET. One should have Biology as his subject in SSC. In 2020, 15.97 lakh students registered for this examination. Each year there is an increment of about 60-80k.\r\n\r\n**WHAT COURSES IT OFFERS?**\r\n\r\nNEET is the qualifying door for prestigious medical institutes like AIIMS, MAMC, KGMC, etc. It is the gateway for aspirants to pursue several medical careers such as Allopathy Doctor (MBBS) , Homoeopathy Doctor (BHMS), Ayurveda Doctor (BAMS), Unani Medicine Doctor (BUMS), Dentist (BDS), Physiotherapy (B.Pth), Occupational Therapy, etc.\r\n\r\n#### **FOR BEGINNERS, WHAT TO DO?**\r\n\r\nFirst opt science in class 11th with biology (PCB or PCMB). Solve tons of mcqs, study class 11th and 12th properly. During class 12th appear for NEET, and get admission if getting desired college and course. If not, retry, study again. Take a drop. Its quite normal to take drop for this exam. Reappear and get admission.\r\n\r\nAll the best to all aspirants of NEET.\r\n\r\n😄😄😄\r\n"}]